Instalador/lsplib/Ejemplos/Delphi/Request.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Body><GenerarLiquidacionReq xmlns="http://serviciosjava.afip.gob.ar/wslsp/"><auth><token>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgc3JjPSJDTj13c2FhaG9tbywgTz1BRklQLCBDPUFSLCBTRVJJQUxOVU1CRVI9Q1VJVCAzMzY5MzQ1MDIzOSIgdW5pcXVlX2lkPSI0NzYwOTUyODciIGdlbl90aW1lPSIxNTMxNzY2MzE0IiBleHBfdGltZT0iMTUzMTgwOTU3NCIvPgogICAgPG9wZXJhdGlvbiB0eXBlPSJsb2dpbiIgdmFsdWU9ImdyYW50ZWQiPgogICAgICAgIDxsb2dpbiBlbnRpdHk9IjMzNjkzNDUwMjM5IiBzZXJ2aWNlPSJ3c2xzcCIgdWlkPSJDTj1mZWxlY3Ryb25pY2EsIFNFUklBTE5VTUJFUj1DVUlUIDIwOTM5ODAyNTkzLCBPPWJpdCBpbmdlbmllcmlhLCBDPWFyIiBhdXRobWV0aG9kPSJjbXMiIHJlZ21ldGhvZD0iMjIiPgogICAgICAgICAgICA8cmVsYXRpb25zPgogICAgICAgICAgICAgICAgPHJlbGF0aW9uIGtleT0iMjA5Mzk4MDI1OTMiIHJlbHR5cGU9IjQiLz4KICAgICAgICAgICAgPC9yZWxhdGlvbnM+CiAgICAgICAgPC9sb2dpbj4KICAgIDwvb3BlcmF0aW9uPgo8L3Nzbz4K</token><sign>mtjMiD/ynKmcVeItye2pcC8C/KtslmvfsWIapzHKzViD047GR/ll/ZopblJzeU0lL+iIrOG/4JbJXU/nIY1/PhHaoa4+JNnhOw7tnTexLxhr2Kzfukw3FbXcmvL7V780kqF6WTObRabL7LUOKYue1ZClFDTghe1ajWmjDpApN7I=</sign><cuit>20939802593</cuit></auth><solicitud><codOperacion>5</codOperacion><emisor><puntoVenta>1</puntoVenta><tipoComprobante>186</tipoComprobante><nroComprobante>6</nroComprobante><codCaracter>4</codCaracter><fechaInicioActividades>2005-01-01</fechaInicioActividades><iibb>20160000261</iibb><nroRUCA>1111</nroRUCA></emisor><receptor><codCaracter>4</codCaracter><operador><cuit>30160000011</cuit><iibb>20160000024</iibb><nroRUCA>1011</nroRUCA></operador></receptor><datosLiquidacion><fechaComprobante>2018-07-16</fechaComprobante><fechaOperacion>2018-07-16</fechaOperacion><codMotivo>1</codMotivo><fechaRecepcion>2018-07-16</fechaRecepcion><fechaFaena>2018-07-16</fechaFaena></datosLiquidacion><guia><nroGuia>120</nroGuia></guia><dte><nroDTE>014469997-1</nroDTE><nroRenspa>22.123.1.12345/A5</nroRenspa></dte><itemDetalleLiquidacion><codCategoria>51020102</codCategoria><tipoLiquidacion>2</tipoLiquidacion><cantidad>50</cantidad><precioUnitario>100</precioUnitario><alicuotaIVA>21</alicuotaIVA><cantidadCabezas>200</cantidadCabezas><raza><codRaza>2</codRaza></raza><nroTropa>2</nroTropa></itemDetalleLiquidacion><gasto><codGasto>16</codGasto><baseImponible>100000</baseImponible><alicuota>2</alicuota><alicuotaIVA>10.5</alicuotaIVA></gasto><datosAdicionales>Datos Adicionales</datosAdicionales></solicitud></GenerarLiquidacionReq></SOAP-ENV:Body></SOAP-ENV:Envelope>
